package line_task.task07;
/*
Дан прямоугольник, ширина которого в два раза меньше длинны. Найти площадь прямоугольника
*/

public class Rectangle {
    public static void main(String[] args) {
        int lengthOfRectangle = 20;
        int areaOfRectangle = lengthOfRectangle/2*lengthOfRectangle;
        System.out.println("Area of rectagle = " + areaOfRectangle);
    }

}
